## **Importing basic librabies**

In [2]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import warnings
import seaborn as sns
warnings.filterwarnings('ignore')

## Loading the dateset

In [3]:
path="/100 Sales Records.csv"

In [6]:
dt = pd.read_csv(path)

In [7]:
dt.head()

                              Region  ... Total Profit
0              Australia and Oceania  ...    951410.50
1  Central America and the Caribbean  ...    248406.36
2                             Europe  ...    224598.75
3                 Sub-Saharan Africa  ...     19525.82
4                 Sub-Saharan Africa  ...    639077.50

[5 rows x 14 columns]

In [8]:
dt.tail()

                Region       Country  ...  Total Cost Total Profit
95  Sub-Saharan Africa          Mali  ...    31825.92     65214.72
96                Asia      Malaysia  ...    43367.64     15103.47
97  Sub-Saharan Africa  Sierra Leone  ...   135031.05     93748.05
98       North America        Mexico  ...   326815.89    144521.02
99  Sub-Saharan Africa    Mozambique  ...  2697132.18    889472.91

[5 rows x 14 columns]

In [9]:
dt.describe()

           Order ID   Units Sold  ...    Total Cost  Total Profit
count  1.000000e+02   100.000000  ...  1.000000e+02  1.000000e+02
mean   5.550204e+08  5128.710000  ...  9.318057e+05  4.416820e+05
std    2.606153e+08  2794.484562  ...  1.083938e+06  4.385379e+05
min    1.146066e+08   124.000000  ...  3.612240e+03  1.258020e+03
25%    3.389225e+08  2836.250000  ...  1.688680e+05  1.214436e+05
50%    5.577086e+08  5382.500000  ...  3.635664e+05  2.907680e+05
75%    7.907551e+08  7369.000000  ...  1.613870e+06  6.358288e+05
max    9.940222e+08  9925.000000  ...  4.509794e+06  1.719922e+06

[8 rows x 7 columns]

In [10]:
dt.shape

(100, 14)

In [11]:
dt.isnull().sum()

Region            0
Country           0
Item Type         0
Sales Channel     0
Order Priority    0
Order Date        0
Order ID          0
Ship Date         0
Units Sold        0
Unit Price        0
Unit Cost         0
Total Revenue     0
Total Cost        0
Total Profit      0
dtype: int64

## Converting date object into date

In [12]:
dt['Ship Date'] = pd.to_datetime(dt['Ship Date'])

In [14]:
dt['Ship Date'].min()

Timestamp('2010-02-25 00:00:00')

In [15]:
dt['Ship Date'].max()

Timestamp('2017-06-17 00:00:00')


Year wise sales trend

In [30]:

dt['Year'] = dt['Ship Date'].apply(lambda x: x.strftime('%Y'))
dt['Year']

0     2010
1     2012
2     2014
3     2014
4     2013
      ...
95    2011
96    2011
97    2016
98    2015
99    2012
Name: Year, Length: 100, dtype: object

In [31]:
dt_trendY =  dt.groupby('Year').sum()['Total Revenue'].reset_index()

In [ ]:
plt.figure(figsize=(15,6))
plt.plot(dt_trendY['Year'],dt_trendY['Total Revenue'],color = 'pink')
plt.xticks(rotation='vertical',size=10)
plt.ylabel('Sales')
plt.xlabel('Year')
plt.show()

Month wise sales trend

In [21]:
dt['Month'] = dt['Ship Date'].apply(lambda x: x.strftime('%m'))
dt['Month']

0     06
1     09
2     05
3     07
4     02
      ..
95    09
96    12
97    06
98    08
99    02
Name: Month, Length: 100, dtype: object

In [22]:
dt_trendM =  dt.groupby('Month').sum()['Total Revenue'].reset_index()

In [ ]:
plt.figure(figsize=(15,6))
plt.plot(dt_trendM['Month'],dt_trendM['Total Revenue'],color = 'c')
plt.xticks(rotation='vertical',size=10)
plt.ylabel('Sales')
plt.xlabel('Montht')
plt.show()

Month-Year wise slaes trend

In [27]:

dt['month_year'] = dt['Ship Date'].apply(lambda x: x.strftime('%Y,%m'))
dt['month_year']

0     2010,06
1     2012,09
2     2014,05
3     2014,07
4     2013,02
       ...
95    2011,09
96    2011,12
97    2016,06
98    2015,08
99    2012,02
Name: month_year, Length: 100, dtype: object

In [28]:
dt_trendMY =  dt.groupby('month_year').sum()['Total Revenue'].reset_index()

In [ ]:
plt.figure(figsize=(15,6))
plt.plot(dt_trendMY['month_year'],dt_trendMY['Total Revenue'],color = 'green')
plt.xticks(rotation='vertical',size=10)
plt.ylabel('Sales')
plt.xlabel('Month-Year')
plt.show()

# Done by MD FAYEZ

## What are the top 10 products by sales?


Grouping product name column

In [35]:
product_sales = pd.DataFrame(dt.groupby('Item Type').sum()['Total Revenue'])

Sorting products sales column

In [36]:

product_sales = product_sales.sort_values('Total Revenue',ascending=False)

All product rankings from High to low

In [37]:
product_sales[:]

                 Total Revenue
Item Type
Cosmetics          36601509.60
Office Supplies    30585380.07
Household          29889712.29
Baby Food          10350327.60
Clothes             7787292.80
Cereal              5322898.90
Meat                4503675.75
Personal Care       3980904.84
Vegetables          3089057.06
Beverages           2690794.60
Snacks              2080733.46
Fruits               466481.34

Top 10 products by sales

In [38]:
product_sales[:10]

                 Total Revenue
Item Type
Cosmetics          36601509.60
Office Supplies    30585380.07
Household          29889712.29
Baby Food          10350327.60
Clothes             7787292.80
Cereal              5322898.90
Meat                4503675.75
Personal Care       3980904.84
Vegetables          3089057.06
Beverages           2690794.60

### **Visualizing Top 10 Product with bar chart**

In [ ]:
plt.figure(figsize=(15,6))
sns.barplot(x='Item Type', y= 'Total Revenue',
            data=dt,palette='rocket')
plt.title("BAR PLOT SHOWING PRODUCT RANKING BY SALES ")
plt.show()

### **Which are the most selling products?**

Grouping Item type with Units Sold

In [52]:

product_sell = pd.DataFrame(dt.groupby('Item Type').sum()['Units Sold'])
print(product_sell)

                 Units Sold
Item Type
Baby Food             40545
Beverages             56708
Cereal                25877
Clothes               71260
Cosmetics             83718
Fruits                49998
Household             44727
Meat                  10675
Office Supplies       46967
Personal Care         48708
Snacks                13637
Vegetables            20051

Sorting most selling products

In [53]:
product_sell.sort_values('Units Sold',ascending = False)

                 Units Sold
Item Type
Cosmetics             83718
Clothes               71260
Beverages             56708
Fruits                49998
Personal Care         48708
Office Supplies       46967
Household             44727
Baby Food             40545
Cereal                25877
Vegetables            20051
Snacks                13637
Meat                  10675

In [ ]:
plt.figure(figsize=(20,6))
sns.barplot(x='Item Type',y='Units Sold',data=dt,palette='mako')
plt.title('Most selling items')
plt.show()


### **count of offline vs online sales**

In [ ]:

plt.figure(figsize=(5,2))
sns.countplot(dt['Sales Channel'])
plt.title('Count of offline and online sales')
plt.show()

### Ckecing which Sales Channel has higher revenue

In [ ]:

sns.barplot(x='Sales Channel',y='Total Revenue',data = dt,ci=None,palette="Blues_d")

## **Overall best shipping mode is offline as it gave us more revenue**

Which is the most profitable category and sub-category grouping item with profit

In [47]:

Item_profit = pd.DataFrame(dt.groupby(['Item Type']).sum()['Total Profit'])

Item_profit.sort_values(['Item Type'],ascending = True)

                 Total Profit
Item Type
Baby Food          3886643.70
Beverages           888047.28
Cereal             2292443.43
Clothes            5233334.40
Cosmetics         14556048.66
Fruits              120495.18
Household          7412605.71
Meat                610610.00
Office Supplies    5929583.75
Personal Care      1220622.48
Snacks              751944.18
Vegetables         1265819.63

In [ ]:
plt.figure(figsize=(15,6))
sns.barplot(x='Item Type',y='Total Profit',data=dt,color="blue", saturation=.5,ci=None)
plt.title("Items with profit")

In [ ]:

plt.figure(figsize=(15,6))
sns.barplot(x='Item Type',y='Total Profit',data=dt,color="blue", saturation=.5,ci=None,hue = 'Order Priority')
plt.title("Items with profit")

## **PLot showing items with total profit by order priority**

In [ ]:
plt.figure(figsize=(15,6))
sns.barplot(x='Item Type',y='Total Profit',data=dt,color="orange", saturation=.5,ci=None,hue = 'Order Priority')
plt.title("Items with profit")

## **Done by AJAY KHATRI**